bench/results/scaling-20260427-025940/trillium-mop-c4.h2load.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #2.
Warm-up started for thread #0.
progress: 100% of clients started
Warm-up started for thread #1.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 448317.88 req/s, 39.76MB/s
requests: 3586543 total, 3586543 started, 3586543 done, 3586543 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3586543 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 318.10MB (333548499) total, 245.25MB (257161280) headers (space savings 40.74%), 7.66MB (8036290) data
                     min         max         mean         sd        +/- sd
time for request:       26us      7.44ms       830us       283us    70.85%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :  111458.47   112498.55   112075.11      464.15    75.00%